#include<stdio.h>
#include<string.h>
#include<math.h>

int main(void)
{
    char a[10][500]={"*****    ************   **************************",//一个二维数组存下0-9，中间无空格 
                     "*   *    *    *    **   **    *        **   **   *",
                     "*   *    *    *    **   **    *        **   **   *",
                     "*   *    **************************    ***********",
                     "*   *    **        *    *    **   *    **   *    *",
                     "*   *    **        *    *    **   *    **   *    *",
                     "*****    ***********    ***********    ***********"};  
                     
    int n=0;
    scanf("%d",&n);
    int i=0;
    for(i=0;i<n;i++)
    {
    	char b[1000]="0";
    	scanf("%s",b);
    	printf("%s:\n",b);//存入数据并且输出 
    	int l=0;
    	l=strlen(b);//判断这个数的长度为l 
    	//printf("%d",l);
    	//最后输出的时候有七行（l-1）*7+5列 
    	char c[1000][10000];
    	int r=0;
    	for(r=0;r<l;r++)  
    	{    
    	    int p=0;int q=0; 
    		if(b[r]==0)  //判读第r+1个数 
    		{
    		   	for(p=0;p<7;p++)
    		   	{
    		   		for(q=7*r;q<7*r+5;q++)
    		   		{   
    		   		    
    		   			c[p][q]=a[i][j];
    		   			
					}
				}
			}
		}
    	
	}
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
}
