#include<stdio.h>
#include<math.h>
int main()
{
  
 char a[10][500]={"*****    ************   **************************",//一个二维数组存下0-9，中间无空格 
                  "*   *    *    *    **   **    *        **   **   *",
                  "*   *    *    *    **   **    *        **   **   *",
                  "*   *    **************************    ***********",
                  "*   *    **        *    *    **   *    **   *    *",
                  "*   *    **        *    *    **   *    **   *    *",
                  "*****    ***********    ***********    ***********"};  

int p,q;
scanf("%d",&p);
for(q=0;q<p;q++)
  {
 int b,i,j,n=0,c,x;
 scanf("%d",&b);
 printf("%d:\n",b);
 
 do
 {
  n++; 
 }
while(b/(int)(pow(10,n))); //看它一共有几位 
 
 char d[7][(n-1)*7+5]; //一共需要（n-1）*7+5个空间 
 for(i=0;i<7;i++) 
 {
  for(j=0;j<n;j++)   //判断第几个数 
  {
   c=(int)(b/pow(10,n-j-1))%10;
   for(x=0;x<5;x++)
   {
    d[i][j*7+x]=a[i][c*5+x];
   }
   
   if((j*7+x+1)<((n-1)*7+5)) //最后一个数不打空格 
   {
    d[i][j*7+x]=' '; 
    d[i][j*7+x+1]=' ';       
   }
  }
 }
 
 for(i=0;i<7;i++)
 {
  for(j=0;j<((n-1)*7+5);j++)
  {
   printf("%c",d[i][j]);
  }
  printf("\n");
 }
}
}


