#include<stdio.h>
#include<math.h>
int main(void)
{
    char a[10][500]={"*****    ************   **************************",//一个二维数组存下0-9，中间无空格 
                     "*   *    *    *    **   **    *        **   **   *",
                     "*   *    *    *    **   **    *        **   **   *",
                     "*   *    **************************    ***********",
                     "*   *    **        *    *    **   *    **   *    *",
                     "*   *    **        *    *    **   *    **   *    *",
                     "*****    ***********    ***********    ***********"};  
    
    int k=0;int i=0;
    scanf("%d",&k);
    
    for(i=0;i<k;i++)
    {
    	int x=0;
    	scanf("%d",&x);
    	int n=0;//显示一共有n位但是首位为0不计入
		
		printf("%d:",x);
		printf("\n");
		
		do
		{
			n++; //只要有输入就至少有一位 比如说只输入0 
		}while(x/(int)(pow(10,n))>0);  //判断为n位数
		
		char b[7][(n-1)*7+5]; 
		
		int c=0; //判断该位数是几
		int p=0;int q=0; //p,q分别表示行和有几位数 以数为单位存储 
		for(p=0;p<7;p++)
		{
			for(q=0;q<n;q++) //q是第q个数 
			{
			   
				c=(int)(x/pow(10,n-q-1))%10; 
				//printf("%d\n",c);  
				
				int e=0;
				for(e=0;e<5;e++)
				{
					b[p][q*7+e]=a[p][c*5+e];  //将a对应位置的值赋给b 
				}
				
				if( (q*7+5) < ((n-1)*7+5) )   
				{
					b[p][q*7+5]=' ';
					b[p][q*7+6]=' ';
				}
			}
		} 
		
		for(p=0;p<7;p++)
		{
			for(q=0;q<((n-1)*7+5);q++)   
			{
				printf("%c",b[p][q]);
			}
			printf("\n"); //输出一行后换行 
		}
    	
	}
  return 0; 
} 
